@extends('layouts.master')

@section('title', 'پروفایل')
@section('head')
    <link href="/assets/css/highlight/11.7.0/rainbow.min.css" rel="stylesheet">
    <script src="/assets/js/highlight/11.7.0/highlight.min.js"></script>
    <script src="/assets/js/highlight/highlightjs-line-numbers.min.js"></script>
    <script>
        hljs.highlightAll();
        hljs.initLineNumbersOnLoad();
    </script>

    <link href="/assets/css/editor/easymde/custom-style.css" rel="stylesheet">
@endsection

@section('modal')
    @parent
    @include('discuss.component.report-modal')

@endsection

@section('content')
    <div class="mdk-header-layout__content page-content ">
        <div class="page-section">
            <div class="container page__container">
                @include('profile.profile-details', ['user' => $user])


                <div class="p-2">
                    <a class="btn btn-light rounded-lg" href="{{ route('profile-discuss', $user->username) }}">
                        <span class="">
                            <svg class="mr-2" fill="currentColor" height="15" width="15" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 512 512" xml:space="preserve">
                                <path d="M256,0c-81.626,0-148.035,66.409-148.035,148.035h66.783c0-44.802,36.45-81.252,81.252-81.252s81.252,36.45,81.252,81.252 c0,21.703-8.452,42.108-23.798,57.453c-20.054,20.053-79.536,75.12-80.135,75.675l-10.711,9.913v120.751h66.783v-91.59 c18.43-17.132,55.505-51.747,71.285-67.525c27.961-27.96,43.359-65.135,43.359-104.676C404.035,66.409,337.627,0,256,0z"></path>
                            </svg>
                        پرسش‌ها
                        </span>
                    </a>

                    <a class="btn btn-yellow rounded-lg mx-2" href="{{ route('profile-answers', $user->username) }}">
                        <span class="">
                            <svg class="mr-2" fill="currentColor" width="18" height="18" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
                                <path d="M10,19 C10,19.8897227 8.9391917,20.319213 8.3190139,19.7330526 L8.2407434,19.6507914 L2.2407434,12.6507914 C1.94650147,12.3075091 1.92198131,11.814562 2.16718292,11.4463356 L2.2407434,11.3492086 L8.2407434,4.34920863 C8.81976724,3.6736808 9.90470154,4.03795234 9.99410748,4.88660488 L10,5 L10,8 L11.0379967,8.08649972 C17.1341361,8.59451134 21.8458884,13.616576 21.9962945,19.6999759 L22,20 L19.3412157,18.4806947 C16.6386172,16.9363527 13.5975935,16.0874335 10.491017,16.0064025 L10,16 L10,19 Z"/>
                            </svg>
                            پاسخ‌ها
                        </span>
                    </a>
                </div>
                <hr>
                <div class="mt-3 text-70">
                    @if(!count($user->answers))
                            <div class="text-center my-3 p-3">
                                <div class="text-muted font-size-20pt font-bold">چیزی برای نمایش وجود ندارد!</div>
                                <svg xmlns="http://www.w3.org/2000/svg" class="my-3" width="200" height="200" viewBox="0 0 797.5 834.5" xmlns:xlink="http://www.w3.org/1999/xlink"><title>void</title><ellipse cx="308.5" cy="780" rx="308.5" ry="54.5" fill="#3f3d56"/><circle cx="496" cy="301.5" r="301.5" fill="#3f3d56"/><circle cx="496" cy="301.5" r="248.89787" opacity="0.05"/><circle cx="496" cy="301.5" r="203.99362" opacity="0.05"/><circle cx="496" cy="301.5" r="146.25957" opacity="0.05"/><path d="M398.42029,361.23224s-23.70394,66.72221-13.16886,90.42615,27.21564,46.52995,27.21564,46.52995S406.3216,365.62186,398.42029,361.23224Z" transform="translate(-201.25 -32.75)" fill="#d0cde1"/><path d="M398.42029,361.23224s-23.70394,66.72221-13.16886,90.42615,27.21564,46.52995,27.21564,46.52995S406.3216,365.62186,398.42029,361.23224Z" transform="translate(-201.25 -32.75)" opacity="0.1"/><path d="M415.10084,515.74682s-1.75585,16.68055-2.63377,17.55847.87792,2.63377,0,5.26754-1.75585,6.14547,0,7.02339-9.65716,78.13521-9.65716,78.13521-28.09356,36.8728-16.68055,94.81576l3.51169,58.82089s27.21564,1.75585,27.21564-7.90132c0,0-1.75585-11.413-1.75585-16.68055s4.38962-5.26754,1.75585-7.90131-2.63377-4.38962-2.63377-4.38962,4.38961-3.51169,3.51169-4.38962,7.90131-63.2105,7.90131-63.2105,9.65716-9.65716,9.65716-14.92471v-5.26754s4.38962-11.413,4.38962-12.29093,23.70394-54.43127,23.70394-54.43127l9.65716,38.62864,10.53509,55.3092s5.26754,50.04165,15.80262,69.356c0,0,18.4364,63.21051,18.4364,61.45466s30.72733-6.14547,29.84941-14.04678-18.4364-118.5197-18.4364-118.5197L533.62054,513.991Z" transform="translate(-201.25 -32.75)" fill="#2f2e41"/><path d="M391.3969,772.97846s-23.70394,46.53-7.90131,48.2858,21.94809,1.75585,28.97148-5.26754c3.83968-3.83968,11.61528-8.99134,17.87566-12.87285a23.117,23.117,0,0,0,10.96893-21.98175c-.463-4.29531-2.06792-7.83444-6.01858-8.16366-10.53508-.87792-22.826-10.53508-22.826-10.53508Z" transform="translate(-201.25 -32.75)" fill="#2f2e41"/><path d="M522.20753,807.21748s-23.70394,46.53-7.90131,48.28581,21.94809,1.75584,28.97148-5.26754c3.83968-3.83969,11.61528-8.99134,17.87566-12.87285a23.117,23.117,0,0,0,10.96893-21.98175c-.463-4.29531-2.06792-7.83444-6.01857-8.16367-10.53509-.87792-22.826-10.53508-22.826-10.53508Z" transform="translate(-201.25 -32.75)" fill="#2f2e41"/><circle cx="295.90488" cy="215.43252" r="36.90462" fill="#ffb8b8"/><path d="M473.43048,260.30832S447.07,308.81154,444.9612,308.81154,492.41,324.62781,492.41,324.62781s13.70743-46.39439,15.81626-50.61206Z" transform="translate(-201.25 -32.75)" fill="#ffb8b8"/><path d="M513.86726,313.3854s-52.67543-28.97148-57.943-28.09356-61.45466,50.04166-60.57673,70.2339,7.90131,53.55335,7.90131,53.55335,2.63377,93.05991,7.90131,93.93783-.87792,16.68055.87793,16.68055,122.90931,0,123.78724-2.63377S513.86726,313.3854,513.86726,313.3854Z" transform="translate(-201.25 -32.75)" fill="#d0cde1"/><path d="M543.2777,521.89228s16.68055,50.91958,2.63377,49.16373-20.19224-43.89619-20.19224-43.89619Z" transform="translate(-201.25 -32.75)" fill="#ffb8b8"/><path d="M498.50359,310.31267s-32.48318,7.02339-27.21563,50.91957,14.9247,87.79237,14.9247,87.79237l32.48318,71.11182,3.51169,13.16886,23.70394-6.14547L528.353,425.32067s-6.14547-108.86253-14.04678-112.37423A33.99966,33.99966,0,0,0,498.50359,310.31267Z" transform="translate(-201.25 -32.75)" fill="#d0cde1"/><polygon points="277.5 414.958 317.885 486.947 283.86 411.09 277.5 414.958" opacity="0.1"/><path d="M533.896,237.31585l.122-2.82012,5.6101,1.39632a6.26971,6.26971,0,0,0-2.5138-4.61513l5.97581-.33413a64.47667,64.47667,0,0,0-43.1245-26.65136c-12.92583-1.87346-27.31837.83756-36.182,10.43045-4.29926,4.653-7.00067,10.57018-8.92232,16.60685-3.53926,11.11821-4.26038,24.3719,3.11964,33.40938,7.5006,9.18513,20.602,10.98439,32.40592,12.12114,4.15328.4,8.50581.77216,12.35457-.83928a29.721,29.721,0,0,0-1.6539-13.03688,8.68665,8.68665,0,0,1-.87879-4.15246c.5247-3.51164,5.20884-4.39635,8.72762-3.9219s7.74984,1.20031,10.062-1.49432c1.59261-1.85609,1.49867-4.559,1.70967-6.99575C521.28248,239.785,533.83587,238.70653,533.896,237.31585Z" transform="translate(-201.25 -32.75)" fill="#2f2e41"/><circle cx="559" cy="744.5" r="43" fill="#fed700"/><circle cx="54" cy="729.5" r="43" fill="#fed700"/><circle cx="54" cy="672.5" r="31" fill="#fed700"/><circle cx="54" cy="624.5" r="22" fill="#fed700"/></svg>
                            </div>
                        @else
                            @foreach($answers = $user->answers()->orderBy('id', 'desc')->paginate(10) as $answer)
                                <div class="card card-body border-0 shadow-none w-100">
                                    <div class="d-flex flex-column flex-lg-row align-items-center">
                                        <div class="">
                                            <span class="font-bold text-50">
                                                پاسخ مربوط به پرسش:
                                                <a href="{{ route('discuss-question', $answer->question->slug) }}" class="text-primary font-bold">
                                                    {{ Str::words($answer->question->subject, 10, '...') }}
                                                </a>
                                            </span>
                                        </div>
                                        <div class="ml-lg-auto ml-2">
                                            <a href="{{ route('discuss-question', $answer->question->slug) }}" class="h6 text-primary">
                                                مشاهده پرسش
                                                <svg class="ml-2" width="18" height="18" viewBox="0 0 23 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <path opacity="0.4" d="M16.5073 6.34863L21.0752 5.94466C22.1003 5.94466 22.9315 6.7839 22.9315 7.81901C22.9315 8.85412 22.1003 9.69336 21.0752 9.69336L16.5073 9.28938C15.7031 9.28938 15.0511 8.63105 15.0511 7.81901C15.0511 7.00561 15.7031 6.34863 16.5073 6.34863" fill="currentColor"></path>
                                                    <path d="M1.16786 6.42292C1.23926 6.35083 1.50598 6.04614 1.75653 5.79314C3.21811 4.20852 7.03437 1.61734 9.03073 0.824345C9.33382 0.697847 10.1003 0.428528 10.5112 0.409485C10.9032 0.409485 11.2776 0.500618 11.6346 0.680164C12.0805 0.931801 12.4361 1.32898 12.6328 1.79689C12.7581 2.12061 12.9548 3.09315 12.9548 3.11084C13.1501 4.17315 13.2565 5.9006 13.2565 7.81032C13.2565 9.62754 13.1501 11.2843 12.9898 12.3643C12.9723 12.3833 12.7756 13.5898 12.5614 14.0033C12.1694 14.7596 11.4029 15.2275 10.5826 15.2275H10.5112C9.97638 15.2098 8.85292 14.7405 8.85292 14.7242C6.96297 13.9312 3.23697 11.4652 1.73902 9.82613C1.73902 9.82613 1.31604 9.40447 1.13284 9.14195C0.84726 8.76381 0.70447 8.29591 0.70447 7.828C0.70447 7.30568 0.864772 6.82009 1.16786 6.42292" fill="currentColor"></path>
                                                </svg>
                                            </a>
                                        </div>
                                    </div>
                                    <hr>
                                    @include('discuss.component.answer-card', ['answer' => $answer, 'question' => $answer->question])
                                </div>
                            @endforeach
                            <div class="mb-32pt d-flex flex-row">
                                {{ $answers->appends($_GET)->links('vendor.pagination.custom') }}
                            </div>
                        @endif
                </div>

            </div>
        </div>
    </div>
@endsection


@section('script')
    <script src="/assets/js/manage-follow.js"></script>
    <script src="/assets/js/manage-discuss.js"></script>
    <script type="text/javascript" src="/assets/js/discuss-like-dislike.js"></script>
    <script src="/assets/js/copy-link.js"></script>
@endsection

